// -*- tab-width: 2; indent-tabs-mode: nil; coding: utf-8-with-signature -*-
//-----------------------------------------------------------------------------
// Copyright 2000-2021 CEA (www.cea.fr) IFPEN (www.ifpenergiesnouvelles.com)
// See the top-level COPYRIGHT file for details.
// SPDX-License-Identifier: Apache-2.0
//-----------------------------------------------------------------------------
/*---------------------------------------------------------------------------*/
/* MeshArea.h                                                  (C) 2000-2006 */
/*                                                                           */
/* Accès aux informations d'un maillage.                                     */
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

#include "arcane/utils/ArcanePrecomp.h"

#include "arcane/IMeshArea.h"
#include "arcane/ItemGroup.h"
#include "arcane/MeshAreaAccessor.h"

/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

ARCANE_BEGIN_NAMESPACE

/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

MeshAreaAccessor::
MeshAreaAccessor(IMeshArea* mesh_area)
: m_mesh_area(mesh_area)
{
}

/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

MeshAreaAccessor::
~MeshAreaAccessor()
{
}

/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

void MeshAreaAccessor::
setMeshArea(IMeshArea* area)
{
  m_mesh_area = area;
}

IMeshArea* MeshAreaAccessor::
meshArea()
{
  return m_mesh_area;
}

/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

Integer MeshAreaAccessor::
nbNode()
{
  return m_mesh_area->nbNode();
}

Integer MeshAreaAccessor::
nbCell()
{
  return m_mesh_area->nbCell();
}

/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

NodeGroup MeshAreaAccessor::
allNodes()
{
  return m_mesh_area->allNodes();
}

CellGroup MeshAreaAccessor::
allCells()
{
  return m_mesh_area->allCells();
}

/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

NodeGroup MeshAreaAccessor::
ownNodes()
{
  return m_mesh_area->ownNodes();
}

CellGroup MeshAreaAccessor::
ownCells()
{
  return m_mesh_area->ownCells();
}

/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

ARCANE_END_NAMESPACE

/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

